{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"module_wrapper_input": {"name": "module_wrapper_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"module_wrapper_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_wrapper_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/dense/BiasAdd", "op": "_FusedMatMul", "input": ["module_wrapper_input", "StatefulPartitionedCall/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/module_wrapper/dense/BiasAdd", "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/LeakyRelu", "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/LeakyRelu", "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/LeakyRelu", "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/LeakyRelu", "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/module_wrapper/dense/MatMul/ReadVariableOp", "shape": [3, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/dense/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/MatMul/ReadVariableOp", "shape": [3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/dense_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_2/dense_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_3/dense_3/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_4/dense_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/MatMul/ReadVariableOp", "shape": [32, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_5/dense_5/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}